       IDENTIFICATION DIVISION.
       PROGRAM-id. MPROG1.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01  WS-F1   PIC 99.
       01  WS-F2   PIC 99.
       01  RESULT  PIC 999.
       PROCEDURE DIVISION.
       MAIN-PARA.
           DISPLAY 'ENTER INPUT-1 ', WITH NO ADVANCING
           ACCEPT WS-F1
           DISPLAY 'ENTER INPUT-2 ', WITH NO ADVANCING
           ACCEPT WS-F2
           CALL 'SPROG1' USING WS-F1, WS-F2, RESULT
           DISPLAY 'INPUT1 ', WS-F1
           DISPLAY 'INPUT2 ', WS-F2
           DISPLAY 'RESULT ', RESULT
           STOP RUN.
