IDENTIFICATION DIVISION.
PROGRAM-ID. READVSAM.
ENVIRONMENT DIVISION.
INPUT-OUTPUT SECTION.
FILE-CONTROL.
    SELECT EMPLOYEE-FILE ASSIGN TO 'EMPVSAM.DAT'
	ORGANIZATION IS INDEXED
	ACCESS MODE  IS RANDOM
	RECORD KEY   IS EMP-ID
	FILE STATUS  IS WS-FILE-STAT.
DATA DIVISION.
FILE SECTION.
FD  EMPLOYEE-FILE.
01  EMPLOYEE-RECORD.
    03  EMP-ID		PIC X(05).
    03  FILLER		PIC X(45).
WORKING-STORAGE SECTION.
01  WS-FILE-STAT	PIC X(02).
01  WS-EMP-ID		PIC X(05).1
PROCEDURE DIVISION.
MAIN-PARA.
    OPEN INPUT EMPLOYEE-FILE
    ACCEPT WS-EMP-ID.
    MOVE WS-EMP-ID TO EMP-ID
    READ EMPLOYEE-FILE
	KEY IS EMP-ID
	   INVALID KEY
		DISPLAY 'EMPLOYEE DOES NOT EXIST'
	   NOT INVALID KEY
		DISPLAY 'EMP FOUND ', EMPLOYEE-RECORD
    END-READ
    CLOSE EMPLOYEE-FILE
    STOP RUN.
