       IDENTIFICATION DIVISION.       
       PROGRAM-ID. PROG1.
       PROCEDURE DIVISION.
           DISPLAY'*-----------------------------------*'
           DISPLAY 'HELLO CAP GEMINI SOFTWARE ASSOCIATES'
           DISPLAY '*-----------------------------------*'
           STOP RUN.
